<!DOCTYPE html>
<html lang="cs">
<head>
    <meta charset="UTF-8">
    <title>help</title>
</head>
<body>
<p><strong>Uživatelsk&aacute; př&iacute;ručka: Zapomněn&iacute; &ndash; JavaFX edice</strong><br/>
    <strong>&Uacute;vod do děje:</strong><br/>
    Je zima a p&iacute;&scaron;e se rok 2006. Jste student vysok&eacute; &scaron;koly a žijete sami na bytě v&nbsp;Praze.
    Praha nen&iacute; va&scaron;&iacute;m rodn&yacute;m městem a s&nbsp;rodiči nejste v&nbsp;kontaktu již dlouho kvůli
    rodinn&eacute;mu konfliktu. V&nbsp;Praze nikoho moc nezn&aacute;te a žijete samot&aacute;řsk&yacute; život. Ned&aacute;vno
    V&aacute;s vyhodili i z&nbsp;pr&aacute;ce a ocit&aacute;te se v&nbsp;situaci, kdy jste bez př&iacute;jmů a snaž&iacute;te
    se u&scaron;etřit na každ&eacute; koruně. Ve &scaron;kole se V&aacute;m hromad&iacute; resty a nedok&aacute;žete
    kvůli okoln&iacute; situaci se soustředit na studium. Situaci přest&aacute;v&aacute;te zvl&aacute;dat a nev&iacute;te
    co d&aacute;l. V&nbsp;hlavě m&aacute;te zafixov&aacute;no, že si stejně ani nikdo nev&scaron;imne, pokud byste
    &bdquo;zmizeli&ldquo;&hellip;<br/>
    Hra m&aacute; otevřen&eacute; konce k&nbsp;interpretaci. Je na V&aacute;s, co s&nbsp;postavou uděl&aacute;te. Pokud
    chcete postavu zab&iacute;t, můžete to udělat. Pokud ji chcete zachr&aacute;nit, to můžete udělat tak&eacute;.</p>

<div style="background:#eee;border:1px solid #ccc;padding:5px 10px;"><strong>VAROV&Aacute;N&Iacute;:</strong></div>

<div style="background:#eee;border:1px solid #ccc;padding:5px 10px;"><strong>Tato hra obsahuje sebevražedn&eacute;
    motivy. Pokud m&aacute;te psychick&eacute; probl&eacute;my, nebo zn&aacute;te někoho, kdo se pot&yacute;k&aacute; s
    obt&iacute;žemi, existuje pomoc.</strong></div>

<div style="background:#eee;border:1px solid #ccc;padding:5px 10px;"><strong>Linka bezpeč&iacute;: 116&nbsp;111</strong>
</div>

<div style="background:#eee;border:1px solid #ccc;padding:5px 10px;"><strong>Pražsk&aacute; linka důvěry: 222 580&nbsp;697</strong>
</div>

<p><strong>Seznam př&iacute;kazů:</strong><br/>
    Jdi &lt;prostor&gt; &ndash; postava se přesune do jin&eacute;ho m&iacute;sta &ndash; např. &bdquo;jdi
    kuchyn&ldquo;<br/>
    Napoveda &ndash; seznam z&aacute;kladn&iacute;ch př&iacute;kazů a co může hr&aacute;č dělat<br/>
    Konec &ndash; ukončen&iacute; hry<br/>
    Seber &lt;věc&gt; - postava sebere určitou věc v&nbsp;prostoru, pokud m&aacute; m&iacute;sto v&nbsp;invent&aacute;ři
    a je věc sebrateln&aacute; &ndash; může sebrat jenom jednu věc najednou &ndash; např. &bdquo;seber pen&iacute;ze&ldquo;<br/>
    Bodnout &ndash; postava se bodne nožem, pokud jej m&aacute; v&nbsp;invent&aacute;ři a zabije se<br/>
    Koupit &ndash; postava si nakoup&iacute; drogy u drogov&eacute;ho dealera, kter&yacute;ma se před&aacute;vkuje a
    umře<br/>
    Obesit &ndash; postava se oběs&iacute; a umře<br/>
    Skocit &ndash; postava skoč&iacute; z&nbsp;m&iacute;st kde to je možn&eacute; a zabije se<br/>
    Zavolat &ndash; postava zavol&aacute; sv&yacute;m rodičům v&nbsp;prostoru kde může<br/>
    Zazvonit &ndash; postava zazvon&iacute; v&nbsp;m&iacute;stě, kde to bude možn&eacute;<br/>
    Inventar &ndash; vyp&iacute;&scaron;e co m&aacute; postava v invent&aacute;ři</p>


<p><strong>Spu&scaron;těn&iacute; hry &ndash; grafick&eacute; rozhran&iacute;:</strong><br/>
    Hra se spou&scaron;t&iacute; otevřen&iacute;m souboru &bdquo;Zapomněn&iacute;.jar&ldquo;</p>


<p><strong>Spu&scaron;těn&iacute; hry &ndash; textov&aacute; edice:</strong><br/>
    Hra je napsan&aacute; v Javě, na spu&scaron;těn&iacute; je potřeba m&iacute;t nainstalovanou verzi <strong>Java 8 a
        v&yacute;&scaron;</strong>.<br/>
    Hra se na <strong>Windows</strong> syst&eacute;mech d&aacute; spustit pomoc&iacute; souboru &quot;<strong>WindowsStart.bat</strong>&quot;.
</p>


<p>Na <strong>macOS a UNIX</strong> syst&eacute;mech může b&yacute;t hra spu&scaron;těna pomoc&iacute; souboru
    &quot;<strong>macOSStart.command</strong>&quot;.<br/>
    Na <strong>macOS</strong> dostanete upozorněn&iacute; při otevřen&iacute; souboru, že <strong>poch&aacute;z&iacute;
        od nezn&aacute;m&eacute;ho v&yacute;voj&aacute;ře</strong> &ndash; pokud se V&aacute;m toto stane, <strong>klikněte
        prav&yacute;m na soubor, dejte otevř&iacute;t a znovu otevř&iacute;t</strong>.<br/>
    Pokud dostanete na <strong>macOS </strong>chybu o po&scaron;kozen&eacute;m souboru, <strong>přejděte rovnou na manu&aacute;ln&iacute;
        spu&scaron;těn&iacute;.</strong><br/>
    Může se st&aacute;t, že bude potřeba přiřadit souboru opr&aacute;vněn&iacute; pro spu&scaron;těn&iacute;, to uděl&aacute;te
    přes termin&aacute;l, kde nap&iacute;&scaron;ete <strong>&quot;chmod +x &quot; a přet&aacute;hnete
        soubor</strong>.<br/>
    Hru lze samozřejmě <strong>spustit manu&aacute;lně</strong> navigov&aacute;n&iacute;m konzole/termin&aacute;lu do
    složky &quot;/out/artifacts/AdventuraZapomneni_jar/&quot; a zad&aacute;n&iacute;m př&iacute;kazu &quot;java -jar
    AdventuraZapomneni.jar&quot;.</p>


<p>4IT115, luut02</p>

</body>
</html>
